InformationRegisters/СтатусыПроверкиДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>СтатусыПроверкиДокументов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусПроверки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПроверкиФинансовыхДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Проверил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннееПотребление</v8:Type>
						<v8:Type>cfg:DocumentRef.ПодготовкаКПередачеНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаписьКнигиПокупок</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеВЭксплуатации</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.РезервыПоОплатеТруда</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеУслугВПодразделение</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеМатериаловВПроизводстве</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ПереоценкаНМА2_4</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаОСВАренду</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияПоПлатежнойКарте</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученныйАванс</v8:Type>
						<v8:Type>cfg:DocumentRef.ТаможеннаяДекларацияИмпорт</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеУслугПоАренде</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнойДокументПодтвержденияНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеРеверсивногоНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковВзаиморасчетовПоАренде</v8:Type>
						<v8:Type>cfg:DocumentRef.ПодготовкаКПередачеНМА2_4</v8:Type>
						<v8:Type>cfg:DocumentRef.ПринятиеКУчетуОС</v8:Type>
						<v8:Type>cfg:DocumentRef.Бронирование</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнесениеДенежныхСредствВКассуККМ</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеОценочныхОбязательствПоОтпускам</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеОС2_4</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтгрузкаТоваровСХранения</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеПараметровОС2_4</v8:Type>
						<v8:Type>cfg:DocumentRef.РаспределениеПроизводственныхЗатрат</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеБезналичныхДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураНаНеподтвержденнуюРеализацию0</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратОСИзАренды2_4</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияПоЯндексКассе</v8:Type>
						<v8:Type>cfg:DocumentRef.ОбесценениеВНА</v8:Type>
						<v8:Type>cfg:DocumentRef.АктВыполненныхВнутреннихРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровНаСклад</v8:Type>
						<v8:Type>cfg:DocumentRef.ОбъединениеОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПрочиеДоходыРасходы</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыкупПринятыхНаХранениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданныйАванс</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПоКомиссииМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеОС2_4</v8:Type>
						<v8:Type>cfg:DocumentRef.РаспределениеРасходовБудущихПериодов</v8:Type>
						<v8:Type>cfg:DocumentRef.РазукомплектацияОС</v8:Type>
						<v8:Type>cfg:DocumentRef.МодернизацияОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитенту</v8:Type>
						<v8:Type>cfg:DocumentRef.МодернизацияОС2_4</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеНДСНаРасходы</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеНедостачТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РаспределениеПрочихЗатрат</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровОтХранителя</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияУслугПрочихАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПодготовкаКПередачеОС2_4</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеУсловийДоговораАренды</v8:Type>
						<v8:Type>cfg:DocumentRef.ДвижениеПродукцииИМатериалов</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявлениеОВвозеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:DocumentRef.ПереоценкаОС2_4</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.Сторно</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровХранителю</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОператораСистемыПлатон</v8:Type>
						<v8:Type>cfg:DocumentRef.ПодготовкаКПередачеОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПересортицаТоваровУХранителя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеАрендованныхОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеЗарплатыВФинансовомУчете</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводОстатковВнеоборотныхАктивов2_4</v8:Type>
						<v8:Type>cfg:DocumentRef.ПереоценкаНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаСырьяПереработчику</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетБанкаПоОперациямЭквайринга</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаЗадолженностиПоФинансовымИнструментам</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаНазначенияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПересортицаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыбытиеДенежныхДокументов</v8:Type>
						<v8:Type>cfg:DocumentRef.УлучшениеНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ПодтверждениеЗачисленияЗарплаты</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДенежныхДокументов</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ПринятиеКУчетуНМА2_4</v8:Type>
						<v8:Type>cfg:DocumentRef.ПерерасчетИмущественныхНалогов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПоКомиссииМеждуОрганизациямиОСписании</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеДивидендов</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаПриобретения</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОСписании</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПереработчика</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыкупВозвратнойТарыКлиентом</v8:Type>
						<v8:Type>cfg:DocumentRef.ПереоценкаОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеНМА2_4</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРасчетовПоНалогам</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеУслугПрочихАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.АннулированиеПодарочныхСертификатов</v8:Type>
						<v8:Type>cfg:DocumentRef.АктВыполненныхРабот</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеНМА2_4</v8:Type>
						<v8:Type>cfg:DocumentRef.РаспределениеВозвратныхОтходов</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияНаличныхДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ПринятиеКУчетуОС2_4</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеПараметровОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеИзлишковТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаСтоимостиИАмортизацииОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхВозвратах</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратСырьяОтПереработчика</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаЗадолженности</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеТМЦВЭксплуатации</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыпускПродукции</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОСписанииТоваровСХранения</v8:Type>
						<v8:Type>cfg:DocumentRef.СборкаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемкаТоваровНаХранение</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОСписанииТоваровУХранителя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПроизводствоБезЗаказа</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеПроцентовПоАренде</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОСписании</v8:Type>
						<v8:Type>cfg:DocumentRef.ПринятиеКУчетуУзловКомпонентовАмортизации</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратМатериаловИзПроизводства</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыкупАрендованныхОС</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеСписаниеРезервовПредстоящихРасходов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеПараметровНМА2_4</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратОСИзАренды</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыкупВозвратнойТарыУПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеИзЭксплуатации</v8:Type>
						<v8:Type>cfg:DocumentRef.ВзаимозачетЗадолженности</v8:Type>
						<v8:Type>cfg:DocumentRef.ДепонированиеЗарплаты</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеРасхожденийПриИнкассацииДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПрочееОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.НачисленияКредитовИДепозитов</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаСтоимостиИАмортизацииНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияПодарочныхСертификатов</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаписьКнигиПродаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеОС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПереработчика2_5</v8:Type>
						<v8:Type>cfg:DocumentRef.ПризнаниеРасходовПоИсследованиямИРазработкам</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратПодарочныхСертификатов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеБезналичныхДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыкупТоваровХранителем</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаВидаДеятельностиНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаОСВАренду2_4</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаМатериаловВПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.ПрекращениеДоговораАренды</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеИзлишковТоваровУХранителя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПринятиеКУчетуНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученныйНалоговыйАгент</v8:Type>
						<v8:Type>cfg:DocumentRef.ПорчаТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеОтПереработчика</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеНМА</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыбытиеАрендованныхОС</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураНалоговыйАгент</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаключениеДоговораАренды</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтражениеЗарплатыВФинансовомУчете2_5</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыемкаДенежныхСредствИзКассыККМ</v8:Type>
						<v8:Type>cfg:DocumentRef.РаспределениеНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОЗакупках</v8:Type>
						<v8:Type>cfg:DocumentRef.ПорчаТоваровУХранителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыПроверкиФинансовыхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СтатусыПроверкиФинансовыхДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеПроверен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проверен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КПовторнойПроверке</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ПроверкаДокументовСервер/Ext/Module.bsl
//////////////////////////////////////////////////////////////////////////////////////////////
// Проверка документов: методы, работающие на  стороне сервера.
//  
//////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ОбработчикиСобытияФорм
// Процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//  Форма					- ФормаКлиентскогоПриложения - форма, из обработчика события которой происходит вызов процедуры;
//  Отказ					- Булево - признак отказа от создания формы;
//  СтандартнаяОбработка	- Булево - признак выполнения стандартной (системной) обработки события;
//  ДополнительныеПараметры	- Структура - дополнительные параметры.
//
Процедура ПриСозданииФормыНаСервере(Форма, Отказ, СтандартнаяОбработка, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если НаФормуДокументаДобавляетсяКомандаПроверки(Форма) Тогда
		
		ДобавитьРеквизитыПроверкиНаФорму(Форма);
		
		КомандаФормы = ДобавитьКомандуПроверкиНаФорму(Форма);
		
		Если КомандаФормы <> Неопределено Тогда
			ОбновитьДанныеПроверкиДокументаНаФорме(Форма);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИзменятьКартинкуПроверкиНаФормеСписка(Форма, ДополнительныеПараметры) Тогда
		// По умолчанию на форме списка отображается замок, в случае проверки документа, но если список смотрит с правами
		// изменения статуса проверки, то для него целесообразнее установить зеленую галочку (как сделано в форме документа).
		
		УстановитьСвойстваКартинкиПроверкиНаФормеСписка(Форма, ДополнительныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//	Форма					- ФормаКлиентскогоПриложения - форма, из обработчика события которой происходит вызов процедуры;
//	ТекущийОбъект			- ДокументОбъект - обрабатываемый объект, который будет прочитан.
//
Процедура ПриЧтенииФормыНаСервере(Форма, ТекущийОбъект) Экспорт
	
	Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(Форма, "ПроверкаДокументов_ДокументПроверен") Тогда
		// Форма является проверяемой, значит на ней присутствуют все необходимые реквизиты и команды.
		
		ДанныеПроверки = РегистрыСведений.СтатусыПроверкиДокументов.ПолучитьДанныеПроверкиДокумента(ТекущийОбъект.Ссылка);
		ОбновитьДанныеПроверкиДокументаНаФорме(Форма, ДанныеПроверки);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//	Форма					- ФормаКлиентскогоПриложения - форма, из обработчика события которой происходит вызов процедуры.
//	ТекущийОбъект			- ДокументОбъект - записываемый объект.
//	ПараметрыЗаписи			- Структура - дополнительные параметры записи.
//
Процедура ПослеЗаписиНаСервере(Форма,  ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	Если НЕ ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(Форма, "ПроверкаДокументов_ДокументПроверен")
		И НаФормуДокументаДобавляетсяКомандаПроверки(Форма) Тогда
		
		ДобавитьРеквизитыПроверкиНаФорму(Форма);
		
		ДобавитьКомандуПроверкиНаФорму(Форма);
		
		ОбновитьДанныеПроверкиДокументаНаФорме(Форма);
		
	КонецЕсли;
	
КонецПроцедуры

// В случае использования проверки документов по регл. учету, добавляет в запрос динамического списка журнала документов,
//	условное соединение с регистром сведений "СтатусыПроверкиДокументов" и параметры-шаблоны заменяет на выражения.
//
//	Параметры:
//		ТекстЗапроса - Строка - обрабатываемый текст запроса динамического списка;
//		ИмяОсновнойТаблицы - Строка - служит для определения подстановки условного соединения и для определения условия соединения.
//
Процедура ДоработатьЗапросДинамическогоСпискаЖурналаДокументов(ТекстЗапроса, ИмяОсновнойТаблицы) Экспорт
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПроверкуФинансовыхДокументов") Тогда
		
		ТекстПодстановкиСвязи = 
			"ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыПроверкиДокументов КАК СтатусыПроверки
			|	ПО ";
		ТекстУсловийСвязи = Новый Массив;
		ТекстУсловийСвязи.Добавить(ИмяОсновнойТаблицы + ".Организация = СтатусыПроверки.Организация");
		ТекстУсловийСвязи.Добавить(ИмяОсновнойТаблицы + ".Ссылка = СтатусыПроверки.Документ");
		Для каждого ИсключаемыйТип Из ИсключаемыеТипыДляПроверки() Цикл
			ТекстУсловийСвязи.Добавить("ТИПЗНАЧЕНИЯ(СтатусыПроверки.Документ) <> ТИП(Документ." + Метаданные.НайтиПоТипу(ИсключаемыйТип).Имя + ")");
		КонецЦикла;
		ТекстПодстановкиСвязи = ТекстПодстановкиСвязи + СтрСоединить(ТекстУсловийСвязи, Символы.ПС + Символы.Таб + Символы.Таб + "И ");
			
		Если СтрНайти(ТекстЗапроса, "{ЛЕВОЕ СОЕДИНЕНИЕ") = 0 Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "КАК " + ИмяОсновнойТаблицы,
				"КАК " + ИмяОсновнойТаблицы + Символы.ПС + Символы.Таб + "{" + ТекстПодстановкиСвязи + "}" + Символы.ПС);
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "{ЛЕВОЕ СОЕДИНЕНИЕ", "{" + ТекстПодстановкиСвязи + Символы.ПС + Символы.Таб + "ЛЕВОЕ СОЕДИНЕНИЕ");
		КонецЕсли;			
		
		ТекстОпределенияСтатусаПроверки = "ЕСТЬNULL(СтатусыПроверки.СтатусПроверки, ЗНАЧЕНИЕ(Перечисление.СтатусыПроверкиФинансовыхДокументов.ПустаяСсылка))";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СтатусПроверки", ТекстОпределенияСтатусаПроверки);
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИндикаторПроверки",
			ТекстОпределенияСтатусаПроверки + " = ЗНАЧЕНИЕ(Перечисление.СтатусыПроверкиФинансовыхДокументов.Проверен)");
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиПодписокНаСобытия

// Процедура, вызываемая при срабатывании подписки на событие "ПередЗаписью" (см. подписку на событие "ПроверкаДокументовПередЗаписьюДокумента").
// Проверяет, можно ли записывать документ (отказывает в записи, в случае если документ был проверен и стоит жесткая
// блокировка объекта при проверке).
//	
//	Параметры:
//		Источник - ДокументОбъект - см. подписку на событие "ПроверкаДокументовПередЗаписьюДокумента";
//		Отказ - Булево - параметр, определяющий будет ли записываться объект;
//		РежимЗаписи - Булево - режим записи документа;
//		РежимПроведения - Булево - режим проведения документа.
//
Процедура ПередЗаписьюДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	ПередИзменениемДокумента(Источник, Отказ);
	
КонецПроцедуры

// Определяет необходимость в отказе изменения объекта (отказ будет срабатывать если документ был проверен и стоит
// запрет на редактирование проверенных).
//	
//	Параметры:
//		Источник - ДокументОбъект - документ, который изменяется;
//		Отказ - Булево - параметр, определяющий будет ли записываться объект;
//		Удаление - Булево - признак того, что документ удаляется.
//
Процедура ПередИзменениемДокумента(Источник, Отказ, Удаление = Ложь) Экспорт
	
	Если Отказ ИЛИ Источник.ОбменДанными.Загрузка
		ИЛИ (Не ПолучитьФункциональнуюОпцию("ИспользоватьПроверкуФинансовыхДокументов") И Не Удаление)
		ИЛИ Не ЭтотТипДокументаДолженПроверяться(ТипЗнч(Источник.Ссылка))
		ИЛИ ОбновлениеИнформационнойБазы.ВыполняетсяОбновлениеИнформационнойБазы() Тогда
		Возврат;
	КонецЕсли;
	
	НеПроверятьДокумент = Неопределено;
	Источник.ДополнительныеСвойства.Свойство("ПроверкаДокументов_Отключить", НеПроверятьДокумент);
	Если НеПроверятьДокумент = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеПроверки = РегистрыСведений.СтатусыПроверкиДокументов.ПолучитьДанныеПроверкиДокумента(Источник.Ссылка);
	ИзменениеПроверенных = ПолучитьФункциональнуюОпцию("РазрешатьИзменятьПроверенныеФинансовыеДокументы");
	
	Источник.ДополнительныеСвойства.Вставить("ПроверкаДокументов_ДанныеПроверки", ДанныеПроверки);
	
	Если ДанныеПроверки.Проверен И Не ИзменениеПроверенных Тогда
		Отказ = Истина;
		СообщениеОбОшибке = НСтр("ru = 'Документ %Документ% проверен. Нельзя изменять проверенные документы.'");
		СообщениеОбОшибке = СтрЗаменить(СообщениеОбОшибке, "%Документ%", Источник.Ссылка);
		ЗаписьЖурналаРегистрации(НСТр("ru = 'Операция не выполнена.'", ОбщегоНазначения.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка, Источник.Метаданные(), Источник.Ссылка, СообщениеОбОшибке);
		ОбщегоНазначения.СообщитьПользователю(СообщениеОбОшибке, Источник.Ссылка);
	ИначеЕсли ДанныеПроверки.Проверен И Источник.ПометкаУдаления Тогда
		Отказ = Истина;
		СообщениеОбОшибке = НСтр("ru = 'Документ %Документ% проверен. Перед пометкой на удаление, необходимо отменить проверку документа.'");
		СообщениеОбОшибке = СтрЗаменить(СообщениеОбОшибке, "%Документ%", Источник.Ссылка);
		ЗаписьЖурналаРегистрации(НСТр("ru = 'Операция не выполнена.'", ОбщегоНазначения.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка, Источник.Метаданные(), Источник.Ссылка, СообщениеОбОшибке);
		ОбщегоНазначения.СообщитьПользователю(СообщениеОбОшибке, Источник.Ссылка);
	ИначеЕсли Удаление И Не ДанныеПроверки.СтатусПроверки.Пустая() Тогда
		// Очищаем ссылки для непроведенных документов, помечаемых на удаление:
		РегистрыСведений.СтатусыПроверкиДокументов.УстановитьСтатусПроверкиДокументаПриЗаписи(Источник.Ссылка, Источник.Дата, Новый Массив, Новый Структура);
	КонецЕсли;
	
КонецПроцедуры

// Процедура, вызываемая при срабатывании подписки на событие "ОбработкаПроведения" (см. подписку на событие "ПроверкаДокументовОбработкаПроведенияДокумента").
// Устанавливает статус проверки документа на "НеПроверен".
//	
//	Параметры:
//		Источник - ДокументОбъект - см. подписку на событие "ПроверкаДокументовОбработкаПроведенияДокумента";
//		Отказ - Булево - параметр, определяющий будет ли проводиться объект;
//		РежимПроведения - Булево - режим проведения документа.
//
Процедура ПриПроведенииДокумента(Источник, Отказ, РежимПроведения) Экспорт
	
	ПриИзмененииДокумента(Источник, Отказ);
	
КонецПроцедуры

// Процедура, вызываемая при срабатывании подписки на событие "ОбработкаУдаленияПроведения" (см. подписку на событие "ПроверкаДокументовОбработкаУдаленияПроведенияДокумента").
// Устанавливает статус проверки документа на "НеПроверен".
//	
//	Параметры:
//		Источник - ДокументОбъект - см. подписку на событие "ПроверкаДокументовОбработкаУдаленияПроведенияДокумента";
//		Отказ - Булево - параметр, определяющий будет ли распроводиться объект;
//
Процедура ПриОтменеПроведенияДокумента(Источник, Отказ) Экспорт
	
	ПриИзмененииДокумента(Источник, Отказ);
	
КонецПроцедуры

// Изменяет статус проверки документа на "НеПроверен", при условии что данный тип документа проверяется и ФО проверки
// документов включена.
//	
//	Параметры:
//		Источник - ДокументОбъект - документ, который изменяется;
//		Отказ - Булево - параметр, определяющий будет ли проводиться (распроводиться) объект.
//
Процедура ПриИзмененииДокумента(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка ИЛИ Отказ
		ИЛИ Не ПолучитьФункциональнуюОпцию("ИспользоватьПроверкуФинансовыхДокументов")
		ИЛИ Не ЭтотТипДокументаДолженПроверяться(ТипЗнч(Источник.Ссылка))
		ИЛИ ОбновлениеИнформационнойБазы.ВыполняетсяОбновлениеИнформационнойБазы() Тогда
		Возврат;
	КонецЕсли;
	
	НеПроверятьДокумент = Неопределено;
	Источник.ДополнительныеСвойства.Свойство("ПроверкаДокументов_Отключить", НеПроверятьДокумент);
	Если НеПроверятьДокумент = Истина Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);

	Если Источник.ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		
		РегистрыСведений.СтатусыПроверкиДокументов.УстановитьСтатусПроверкиДокументаПриЗаписи(Источник.Ссылка, Источник.Дата, Новый Массив, Новый Структура);
		Возврат;
		
	КонецЕсли;

	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ПрочееОприходованиеТоваров") Тогда
		ДополнительныеПараметрыПроверки = Новый Структура;
		ДополнительныеПараметрыПроверки.Вставить("ХозяйственнаяОперация", Источник.ХозяйственнаяОперация);
	Иначе
		ДополнительныеПараметрыПроверки = Неопределено;
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.Свойство("ПроверкаДокументов_ДанныеПроверки") Тогда
		ДанныеПроверки = Источник.ДополнительныеСвойства.ПроверкаДокументов_ДанныеПроверки;
	Иначе
		ДанныеПроверки = РегистрыСведений.СтатусыПроверкиДокументов.ПолучитьДанныеПроверкиДокумента(Источник.Ссылка);
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("РазрешатьИзменятьПроверенныеФинансовыеДокументы") И ДанныеПроверки.Проверен ИЛИ Не ДанныеПроверки.Проверен Тогда
		
		МассивОрганизаций = МассивОрганизацийДокумента(Источник);
		РегистрыСведений.СтатусыПроверкиДокументов.УстановитьСтатусПроверкиДокументаПриЗаписи(
			Источник.Ссылка, Источник.Дата, МассивОрганизаций, ДанныеПроверки, ДополнительныеПараметрыПроверки);
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область Другое

//	Обновляет форму в зависимости от данных проверки документа.
//
//	Параметры:
//		Форма - ФормаКлиентскогоПриложения - форма, которая должна обновляться:
//			* Объект - ДанныеФормыКоллекция - Объект:
//				** Ссылка - ДокументСсылка -
//		ДанныеПроверки - Структура - структура с данными по проверке документа (см. РегистрыСведений.СтатусыПроверкиДокументов.ПолучитьДанныеПроверкиДокумента).
//
Процедура ОбновитьДанныеПроверкиДокументаНаФорме(Форма, ДанныеПроверки = Неопределено) Экспорт
	
	Если ДанныеПроверки = Неопределено Тогда
		ДанныеПроверки = РегистрыСведений.СтатусыПроверкиДокументов.ПолучитьДанныеПроверкиДокумента(Форма.Объект.Ссылка);
	КонецЕсли;
	
	Форма.ПроверкаДокументов_ДокументПроверен = ДанныеПроверки.Проверен;

	ОпределитьСвойстваКнопкиПроверкиПоДанным(Форма, ДанныеПроверки);
	
	Если ПолучитьФункциональнуюОпцию("РазрешатьИзменятьПроверенныеФинансовыеДокументы") Тогда
		Форма.ПроверкаДокументов_ПодтверждениеЗаписи = Истина;
	Иначе
		БлокировкаФормы(Форма, ДанныеПроверки.Проверен);
	КонецЕсли;
	
КонецПроцедуры

//	Определяет, проверяется ли документ данного типа,
//	определяется на основании наличия данного документа в измерении регистра "СтатусыПроверкиДокументов").
//
//	Параметры:
//		ТипДокумента - Тип - проверяемый тип.
//
//	Возвращаемое значение:
//		Булево - Истина, если документ должен проверяться.
//
Функция ЭтотТипДокументаДолженПроверяться(ТипДокумента) Экспорт
	
	Возврат ПроверяемыеТипыДокументов().Найти(ТипДокумента) <> Неопределено;
	
КонецФункции

// Возвращает массив типов документов, которые участвуют в проверке.
//
// Возвращаемое значение:
//	Массив Из Тип - Типы значения, которые должны проверяться
Функция ПроверяемыеТипыДокументов() Экспорт
	
	СписокПроверяемыхТипов = Метаданные.РегистрыСведений["СтатусыПроверкиДокументов"].Измерения.Документ.Тип.Типы();
	СписокПроверяемыхТипов = ОбщегоНазначенияКлиентСервер.РазностьМассивов(СписокПроверяемыхТипов, ИсключаемыеТипыДляПроверки());
	Возврат СписокПроверяемыхТипов;
	
КонецФункции

// Получает документы, которые не должны учитываться как проверяемые. По ним данные могут храниться в инф. базе, но
// более они не учитываются.
//
// Возвращаемое значение:
//	Массив Из Тип - Типы значения, которые не должны проверяться.
//
Функция ИсключаемыеТипыДляПроверки() Экспорт
	
	МассивВозврата = Новый Массив;
	МассивВозврата.Добавить(Тип("ДокументСсылка.ВводОстатков"));
	МассивВозврата.Добавить(Тип("ДокументСсылка.ВводОстатковВзаиморасчетов"));
	МассивВозврата.Добавить(Тип("ДокументСсылка.ВводОстатковДенежныхСредств"));
	МассивВозврата.Добавить(Тип("ДокументСсылка.ВводОстатковОПродажахЗаПрошлыеПериоды"));
	МассивВозврата.Добавить(Тип("ДокументСсылка.ВводОстатковПоФинансовымИнструментам"));
	МассивВозврата.Добавить(Тип("ДокументСсылка.ВводОстатковПрочиеРасходы"));
	МассивВозврата.Добавить(Тип("ДокументСсылка.ВводОстатковПрочихАктивовПассивов"));
	МассивВозврата.Добавить(Тип("ДокументСсылка.ВводОстатковРасчетовПоЭквайрингу"));
	МассивВозврата.Добавить(Тип("ДокументСсылка.ВводОстатковСПодотчетниками"));
	МассивВозврата.Добавить(Тип("ДокументСсылка.ВводОстатковТоваров"));
	МассивВозврата.Добавить(Тип("ДокументСсылка.ИсправлениеРазвернутогоСальдоТоваровОрганизаций"));
	МассивВозврата.Добавить(Тип("ДокументСсылка.РаспределениеДоходовПоНаправлениямДеятельности"));
	МассивВозврата.Добавить(Тип("ДокументСсылка.РаспределениеНДС"));
	МассивВозврата.Добавить(Тип("ДокументСсылка.РаспределениеПрочихЗатрат"));
	МассивВозврата.Добавить(Тип("ДокументСсылка.РасчетКурсовыхРазниц"));
	МассивВозврата.Добавить(Тип("ДокументСсылка.РасчетПроцентныхРасходовДисконтирования"));
	МассивВозврата.Добавить(Тип("ДокументСсылка.РасчетСебестоимостиТоваров"));
	МассивВозврата.Добавить(Тип("ДокументСсылка.РегистраторРасчетов"));
	//++ НЕ УТ
	МассивВозврата.Добавить(Тип("ДокументСсылка.АмортизацияНМА2_4"));
	МассивВозврата.Добавить(Тип("ДокументСсылка.АмортизацияОС2_4"));
	МассивВозврата.Добавить(Тип("ДокументСсылка.НачислениеПроцентовПоАренде"));
	МассивВозврата.Добавить(Тип("ДокументСсылка.НачислениеСписаниеРезервовПоСомнительнымДолгам"));
	МассивВозврата.Добавить(Тип("ДокументСсылка.РасчетРезервовПодОбесценениеЗапасов"));
	//-- НЕ УТ

	
	ПроверкаДокументовЛокализация.ДополнитьИсключаемыеТипыДляПроверки(МассивВозврата);
	
	Возврат МассивВозврата;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьРеквизитыПроверкиНаФорму(Форма)
	
	МассивДобавляемыхРеквизитов = Новый Массив;
	
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ПроверкаДокументов_ДокументПроверен", Новый ОписаниеТипов("Булево")));
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ПроверкаДокументов_БлокировкаФормы", Новый ОписаниеТипов("Булево")));
	МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ПроверкаДокументов_ПодтверждениеЗаписи", Новый ОписаниеТипов("Булево")));
	
	Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	
КонецПроцедуры

Функция НаФормуДокументаДобавляетсяКомандаПроверки(Форма)
	
	// Управляем проверкой только тогда, когда включена соответствующая функциональная опция.
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьПроверкуФинансовыхДокументов") Тогда
		Возврат Ложь;
	КонецЕсли;	
	
	// Управляем проверкой только тогда, когда есть реквизит "Объект".
	Если Не ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(Форма, "Объект") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Управляем проверкой только тогда, когда форма является формой документа и для этого документа возможно установить
	// статусы проверки.
	Если Не ФормаЯвляетсяФормойДокументаКоторыйПроверяется(Форма) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Управляем проверкой только тогда, когда по документу есть записи в РС "Статусы проверки документов".
	Если ЗначениеЗаполнено(Форма.Объект.Ссылка)
		И НЕ ЕстьЗаписьВРегистреСтатусыПроверки(Форма.Объект.Ссылка) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ФормаЯвляетсяФормойДокументаКоторыйПроверяется(Форма)
	
	РезультатПроверки = Ложь;
	ПолноеИмяФормы = Форма.ИмяФормы;
	
	МассивИмениФормы = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПолноеИмяФормы, ".");
	
	Если МассивИмениФормы.Получить(0) = "Документ" Тогда
		ТипДокументаФормы = Тип("ДокументСсылка."+МассивИмениФормы.Получить(1));
		
		ЭтоФормаДокумента = Ложь;
		РеквизитыФормы = Форма.ПолучитьРеквизиты();
		
		Для Каждого РеквизитФормы Из РеквизитыФормы Цикл
			Если РеквизитФормы.Имя = "Объект"
				И ТипЗнч(Форма.Объект.Ссылка) = Тип("ДокументСсылка."+МассивИмениФормы.Получить(1)) Тогда
					ЭтоФормаДокумента = Истина;
					Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ЭтотТипДокументаДолженПроверяться(ТипДокументаФормы) И ЭтоФормаДокумента Тогда
			РезультатПроверки = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат РезультатПроверки;	
	
КонецФункции

Функция ДобавитьКомандуПроверкиНаФорму(Форма)
	
	РазмещениеКоманды = ОпределитьРазмещениеКомандыПроверки(Форма);
	
	Если РазмещениеКоманды.ГруппаФормы = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИмяКоманды = "ПроверкаДокументов_КомандаИзмененияСтатусаПроверкиДокумента";
	
	КомандаФормы = Форма.Команды.Добавить(ИмяКоманды);
	КомандаФормы.Действие = "Подключаемый_ВыполнитьПереопределяемуюКоманду"; // универсальный обработчик
	КомандаФормы.Заголовок = НСтр("ru = 'Проверено'");
	КомандаФормы.ИзменяетСохраняемыеДанные = Ложь;
	
	ЭлементКомандыФормы = Форма.Элементы.Вставить(ИмяКоманды, Тип("КнопкаФормы"), РазмещениеКоманды.ГруппаФормы, РазмещениеКоманды.Элемент);
	ЭлементКомандыФормы.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	ЭлементКомандыФормы.ИмяКоманды = ИмяКоманды;
	
	Возврат КомандаФормы;
	
КонецФункции

Функция ОпределитьРазмещениеКомандыПроверки(Форма)
	
	РазмещениеКоманды = Новый Структура("ГруппаФормы, Элемент");
	
	КнопкаПроводкиРеглУчета =
		Форма.Элементы.Найти("ФормаОбработкаОтражениеДокументовВРеглУчетеПроводкиРеглУчета");
	КнопкаПроводкиМеждународногоУчета =
		Форма.Элементы.Найти("ФормаОбработкаОтражениеДокументовВМеждународномУчетеПроводкиДокументаОперативногоУчета");
	
	Если КнопкаПроводкиРеглУчета <> Неопределено Тогда
		РазмещениеКоманды.ГруппаФормы = КнопкаПроводкиРеглУчета.Родитель;
	ИначеЕсли КнопкаПроводкиМеждународногоУчета <> Неопределено Тогда
		РазмещениеКоманды.ГруппаФормы = КнопкаПроводкиМеждународногоУчета.Родитель;
	Иначе
		Для каждого ЭлементФормы Из Форма.Элементы Цикл
			Если ТипЗнч(ЭлементФормы) <> Тип("КнопкаФормы")
				ИЛИ СтрНайти(ВРег(ЭлементФормы.Имя), "СПРАВКА") = 0
				ИЛИ ЭлементФормы.Родитель = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			РазмещениеКоманды.ГруппаФормы = ЭлементФормы.Родитель;
		КонецЦикла;
	КонецЕсли;
	
	Если РазмещениеКоманды.ГруппаФормы = Неопределено Тогда
		Возврат РазмещениеКоманды;
	КонецЕсли;
	
	ИндексКнопки = 0;
	ПодчиненныеЭлементы = РазмещениеКоманды.ГруппаФормы.ПодчиненныеЭлементы; // ЭлементыФормы - коллекция подчиненных элементов
	
	Если КнопкаПроводкиРеглУчета <> Неопределено Тогда
		ИндексКнопки = Макс(ПодчиненныеЭлементы.Индекс(КнопкаПроводкиРеглУчета), ИндексКнопки);
	КонецЕсли;
	
	Если КнопкаПроводкиМеждународногоУчета <> Неопределено Тогда
		ИндексКнопки = Макс(ПодчиненныеЭлементы.Индекс(КнопкаПроводкиМеждународногоУчета), ИндексКнопки);
	КонецЕсли;
	
	Если ИндексКнопки > 0 Тогда
		РазмещениеКоманды.Элемент = ПодчиненныеЭлементы.Получить(ИндексКнопки + 1);
	КонецЕсли;
	
	Возврат РазмещениеКоманды;
	
КонецФункции

// Определить свойства кнопки проверки по данным.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма:
// 		* Объект - ДанныеФормыКоллекция -:
// 			** Ссылка - ДокументСсылка -
//  ДанныеОПроверке - см. РегистрыСведений.СтатусыПроверкиДокументов.ПолучитьДанныеПроверкиДокумента
Процедура ОпределитьСвойстваКнопкиПроверкиПоДанным(Форма, ДанныеОПроверке)
	
	КомандаПроверки = Форма.Команды.Найти("ПроверкаДокументов_КомандаИзмененияСтатусаПроверкиДокумента");
	Если КомандаПроверки = Неопределено Тогда
		Возврат;
	КонецЕсли;

	КартинкаКнопки = БиблиотекаКартинок.СтатусДокументПроверен;
	
	ЕстьПравоИзмененияСтатусаПроверки = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.СтатусыПроверкиДокументов);
	
	Если ДанныеОПроверке.СтатусПроверки.Пустая() И Форма.Объект.Ссылка.Пустая() Тогда
		ПодсказкаКнопки = НСтр("ru = 'Проверка документа возможна только после записи документа'");
	Иначе
		Если ЕстьПравоИзмененияСтатусаПроверки Тогда
			ПодсказкаКнопки = НСтр("ru = 'Изменение статуса проверки документа.'");
		Иначе
			Если ДанныеОПроверке.Проверен Тогда
				Если ПолучитьФункциональнуюОпцию("РазрешатьИзменятьПроверенныеФинансовыеДокументы") Тогда
					Комментарий = НСтр("ru = 'изменения не рекомендуются.'");
				Иначе
					Комментарий = НСтр("ru = 'изменение невозможно.'");
				КонецЕсли;
				ПодсказкаКнопки = НСтр("ru = 'Документ проверен'") + ", " + Комментарий;
				КартинкаКнопки = БиблиотекаКартинок.ИсключитьИзНастройкиФормированияПроводок;
			Иначе
				ПодсказкаКнопки = НСтр("ru = 'Документ не проверен.'");
				КартинкаКнопки = БиблиотекаКартинок.ВключитьВНастройкуФормированияПроводок;
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;
	
	Если ДанныеОПроверке.Проверен Тогда
		ПояснениеПроверки = Символы.ПС + НСтр("ru = 'Проверил: %Проверил%, Дата: %ДатаПроверки%'");
		ПояснениеПроверки = СтрЗаменить(ПояснениеПроверки, "%Проверил%", ДанныеОПроверке.Проверил);
		ПояснениеПроверки = СтрЗаменить(ПояснениеПроверки, "%ДатаПроверки%", ДанныеОПроверке.ДатаПроверки);
		ПодсказкаКнопки = ПодсказкаКнопки + ПояснениеПроверки;
	КонецЕсли;
	
	КомандаПроверки.Подсказка = ПодсказкаКнопки;
	КомандаПроверки.Картинка = КартинкаКнопки;
	
	ЭлементКомандыФормы = Форма.Элементы.Найти("ПроверкаДокументов_КомандаИзмененияСтатусаПроверкиДокумента");
	Если Не ЭлементКомандыФормы = Неопределено Тогда
		ЭлементКомандыФормы.Пометка = Форма.ПроверкаДокументов_ДокументПроверен;
	КонецЕсли;
	
КонецПроцедуры

Процедура БлокировкаФормы(Форма, ДокументПроверен)
	
	Если ДокументПроверен Тогда
		// Форма должна быть заблокирована, так как документ проверен и запрещено изменение проверенных документов.
		
		Если Форма.ТолькоПросмотр Тогда
			// Форма уже заблокирована, но не в результате проверки документа, сделаем соответствующую пометку.
			Форма.ПроверкаДокументов_БлокировкаФормы = Ложь;
		Иначе
			// Форма не заблокирована, заблокируем ее и сделаем соответствующую пометку.
			Форма.ТолькоПросмотр = Истина;
			Форма.ПроверкаДокументов_БлокировкаФормы = Истина;
		КонецЕсли;
		
	Иначе
		// Форма не нуждается в блокировке, так как документ не проверен или разрешено изменение проверенных документов.
		
		Если Форма.ПроверкаДокументов_БлокировкаФормы Тогда
			// Форма ранее была заблокирована в результате предыдущей проверке документов - разблокируем форму и снимем пометку о блокировке.
			Форма.ТолькоПросмотр = Ложь;
			Форма.ПроверкаДокументов_БлокировкаФормы = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ИзменятьКартинкуПроверкиНаФормеСписка(Форма, ДополнительныеПараметры)
	
	// Управляем проверкой только тогда, когда включена соответствующая функциональная опция.
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьПроверкуФинансовыхДокументов") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ПравоДоступа("Изменение", Метаданные.РегистрыСведений.СтатусыПроверкиДокументов) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Управляем проверкой только тогда, когда в дополнительных параметрах установлено свойство "МестоРазмещенияДанныхПроверкиРегл":
	//	это означает, что в соответствующий список уже были добавлены необходимые поля, а на форму добавлен элемент "ИндикаторПроверки".
	Если ДополнительныеПараметры = Неопределено Или Не ДополнительныеПараметры.Свойство("МестоРазмещенияДанныхПроверкиРегл") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура УстановитьСвойстваКартинкиПроверкиНаФормеСписка(Форма, ДополнительныеПараметры)
	
	ЭлементГруппаПроверки = ДополнительныеПараметры.МестоРазмещенияДанныхПроверкиРегл; // ГруппаФормы -
	Для каждого ЭлементПроверки Из ЭлементГруппаПроверки.ПодчиненныеЭлементы Цикл
		Если Не СтрНайти(ЭлементПроверки.Имя, "ИндикаторПроверки", НаправлениеПоиска.СКонца) = 0 Тогда
			ЭлементПроверки.КартинкаЗначений = БиблиотекаКартинок.СтатусДокументПроверен;
		КонецЕсли
	КонецЦикла;
	
КонецПроцедуры


// Получает из переданного объекта (ссылки) массив реквизитов с типом "Организация".
//
//	Параметры:
//		ДокументИсточник - ДокументСсылка, ДокументОбъект - объект, реквизиты которого надо проанализировать на соответствие типу "Организация".
// 															Если передан объект - значение реквизиты считывается непосредственно из него, если передана ссылка -
//															- происходит обращение к данным базы запросом (см. ОбщегоНазначения.ЗначенияРеквизитовОбъекта)
//		УчитыватьУправленческуюОрганизацию - Булево - признак, определяющий, должна ли среди возвращаемого массива быть управленческая организация.
// 														Значение по умолчанию - истина;
//
//	Возвращаемое значение:
//	 Массив Из СправочникСсылка.Организации - массив найденных Организаций в документе. 
//	            Если в документе не найдено ни одного реквизита с типом значения "Организация" - будет возвращен массив с ссылкой на пустую организацию.
//
Функция МассивОрганизацийДокумента(ДокументИсточник, УчитыватьУправленческуюОрганизацию = Ложь) Экспорт
	
	МассивОрганизаций = Новый Массив;
	ЭтоОбъект = НЕ ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ДокументИсточник));
	
	МетаданныеДокумента = ДокументИсточник.Метаданные();
	
	ИменаРеквизитовОрганизаций = ИменаРеквизитовОрганизаций(МетаданныеДокумента);
	ИменаРеквизитовОрганизацийТабличныйЧастей = ИменаРеквизитовОрганизацийТабличныйЧастей(МетаданныеДокумента);
	
	Если Справочники.Организации.ИспользуетсяНесколькоОрганизаций() Тогда
		
		Если ЭтоОбъект Тогда
	
			Для каждого ИмяРеквизита Из ИменаРеквизитовОрганизаций Цикл
					
				ТекущаяОрганизация = ДокументИсточник[ИмяРеквизита];
				Если ЗначениеЗаполнено(ТекущаяОрганизация) 
					И ТипЗнч(ТекущаяОрганизация) = Тип("СправочникСсылка.Организации")
					И МассивОрганизаций.Найти(ТекущаяОрганизация) = Неопределено Тогда
					
					Если ИмяРеквизита = "Организация" Тогда
						МассивОрганизаций.Вставить(0, ТекущаяОрганизация);
					Иначе
						МассивОрганизаций.Добавить(ТекущаяОрганизация);
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;
			
			Для каждого КлючИЗначение Из ИменаРеквизитовОрганизацийТабличныйЧастей Цикл
				
				ИмяТабличнойЧасти = КлючИЗначение.Ключ;
				ИменаРеквизитовОрганизаций = КлючИЗначение.Значение;
				
				Для каждого СтрокаТабличнойЧасти Из ДокументИсточник[ИмяТабличнойЧасти] Цикл
					
					Для каждого ИмяРеквизита Из ИменаРеквизитовОрганизаций Цикл
							
						ТекущаяОрганизация = СтрокаТабличнойЧасти[ИмяРеквизита];
						Если ЗначениеЗаполнено(ТекущаяОрганизация) 
							И ТипЗнч(ТекущаяОрганизация) = Тип("СправочникСсылка.Организации")
							И МассивОрганизаций.Найти(ТекущаяОрганизация) = Неопределено Тогда
							МассивОрганизаций.Добавить(ТекущаяОрганизация);
						КонецЕсли;
						
					КонецЦикла;					
					
				КонецЦикла;
				
			КонецЦикла;
	
			Если МассивОрганизаций.Количество() = 0 Тогда
				МассивОрганизаций.Добавить(Справочники.Организации.ПустаяСсылка());
			КонецЕсли;
				
		Иначе
			
			ШаблонЗапросаРеквизита =
			"ВЫБРАТЬ
			|	&Реквизит КАК Организация
			|ИЗ
			|	&ПолноеИмяОбъекта КАК ИмяТаблицы
			|ГДЕ
			|	ИмяТаблицы.Ссылка = &Ссылка
			|	И &УсловиеТипаРеквизита";
			
			ТекстыЗапросов = Новый Массив;
			
			Для каждого ИмяРеквизита Из ИменаРеквизитовОрганизаций Цикл
				
				ТекстЗапроса = СтрЗаменить(ШаблонЗапросаРеквизита, "&ПолноеИмяОбъекта", МетаданныеДокумента.ПолноеИмя()); 
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеТипаРеквизита", "ТИПЗНАЧЕНИЯ(ИмяТаблицы.&Реквизит) = Тип(Справочник.Организации)"); 
				ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Реквизит", ИмяРеквизита);
				 
				ТекстыЗапросов.Добавить(ТекстЗапроса);
				
			КонецЦикла;
			
			Для каждого КлючИЗначение Из ИменаРеквизитовОрганизацийТабличныйЧастей Цикл  
				ИмяТабличнойЧасти = КлючИЗначение.Ключ;
				ИменаРеквизитовОрганизаций = КлючИЗначение.Значение;
				Для каждого ИмяРеквизита Из ИменаРеквизитовОрганизаций Цикл
					
					ТекстЗапроса = СтрЗаменить(ШаблонЗапросаРеквизита, "&ПолноеИмяОбъекта", МетаданныеДокумента.ПолноеИмя() + "." + ИмяТабличнойЧасти); 
					ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеТипаРеквизита", "ТИПЗНАЧЕНИЯ(ИмяТаблицы.&Реквизит) = Тип(Справочник.Организации)"); 
					ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Реквизит", ИмяРеквизита);
					
					ТекстыЗапросов.Добавить(ТекстЗапроса);
					 
				КонецЦикла;
			КонецЦикла;

			Запрос = Новый Запрос;
			Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначенияУТ.РазделительЗапросовВОбъединении(Истина));
			Запрос.УстановитьПараметр("Ссылка", ДокументИсточник);
			
			МассивОрганизаций = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Организация");
			
		КонецЕсли;
		
		ПроверкаДокументовЛокализация.ДополнитьМассивОрганизацийДокумента(МассивОрганизаций, ДокументИсточник, УчитыватьУправленческуюОрганизацию);
		
	Иначе
		
		Если ЭтоОбъект Тогда
			Если ОбщегоНазначенияУТКлиентСервер.ЕстьРеквизитОбъекта(ДокументИсточник, "Организация") Тогда
				МассивОрганизаций.Добавить(ДокументИсточник["Организация"]);
			Иначе
				МассивОрганизаций.Добавить(Справочники.Организации.ПустаяСсылка());
			КонецЕсли;
		Иначе
			Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Организация", МетаданныеДокумента) Тогда
				МассивОрганизаций.Добавить(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументИсточник, "Организация"));
			Иначе
				МассивОрганизаций.Добавить(Справочники.Организации.ПустаяСсылка());
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не УчитыватьУправленческуюОрганизацию Тогда
		ИндексУправленческойОрганизацииВМассиве = МассивОрганизаций.Найти(Справочники.Организации.УправленческаяОрганизация);
		Если НЕ ИндексУправленческойОрганизацииВМассиве = Неопределено Тогда
			МассивОрганизаций.Удалить(ИндексУправленческойОрганизацииВМассиве);
		КонецЕсли;
	КонецЕсли;
	
	Возврат МассивОрганизаций;
	
КонецФункции

Функция ИменаРеквизитовОрганизаций(ОбъектМетаданных)
	
	Результат = Новый Массив;
	
	ТипОрганизация = Тип("СправочникСсылка.Организации");
	Для каждого Реквизит Из ОбъектМетаданных.Реквизиты Цикл
		Если Реквизит.Тип.СодержитТип(ТипОрганизация) Тогда
			Результат.Добавить(Реквизит.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции 

Функция ИменаРеквизитовОрганизацийТабличныйЧастей(ОбъектМетаданных)
	
	Результат = Новый Структура;
	
	ТипОрганизация = Тип("СправочникСсылка.Организации");
	Для каждого ТабличнаяЧасть Из ОбъектМетаданных.ТабличныеЧасти Цикл
		
		МассивРеквизитов = Новый Массив;
		Для каждого Реквизит Из ТабличнаяЧасть.Реквизиты Цикл
			Если Реквизит.Тип.СодержитТип(ТипОрганизация) Тогда
				МассивРеквизитов.Добавить(Реквизит.Имя);
			КонецЕсли;
		КонецЦикла;
		
		Если МассивРеквизитов.Количество() > 0 Тогда
			Результат.Вставить(ТабличнаяЧасть.Имя, МассивРеквизитов);
		КонецЕсли;
		
	КонецЦикла;
		
	Возврат Результат;
	
КонецФункции 

Функция ЕстьЗаписьВРегистреСтатусыПроверки(Ссылка)
	
	НаборЗаписейРС = РегистрыСведений.СтатусыПроверкиДокументов.СоздатьНаборЗаписей();
	НаборЗаписейРС.Отбор.Документ.Установить(Ссылка);
	НаборЗаписейРС.Прочитать();
	
	Возврат НаборЗаписейРС.Количество() > 0;
	
КонецФункции

#КонецОбласти
